{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                {
                    "tag": "greeting",
                    "patterns": [
                        "Hello",
                        "What's up",
                        "Hey",
                        "Greetings!",
                        "Hi!",
                        "Hi matey",
                        "Hey",
                        "Hello",
                        "Hi there",
                        "Hey there",
                        "Hi",
                        "Hello everyone",
                        "Hey everyone",
                        "Are you up?",
                        "Are you there?",
                        "Are you awake?",
                        "Is anyone here?",
                        "Is anyone online?",
                        "are you there?",
                        "are you up?",
                        "are you awake?"
                    ]
                }
            ],
            "responses": [
                "Hey there, how may I assist you?",
                "Hello, how may I help you?",
                "Hey, how can I be of assistance?",
                "Hello there, how can I be of help?",
                "Hi there, what can I do for you?",
                "Greetings, how can I assist?",
                "Hello, how may I assist you with anything?",
                "Hey, how can I assist you today?",
                "Hello, how may I be of service?",
                "Good day, how can I help?",
                "Hello, how may I be of assistance to you?",
                "Hey there, what can I do for you?",
                "Hello, how can I assist you at the moment?",
                "Hi, how may I assist you?",
                "Hello there, how may I help you today?",
                "Greetings, how may I assist you?",
                "Hello, how can I help you with anything today?",
                "Hey, how may I be of service?",
                "Hello, how can I be of assistance to you?",
                "Good day, how may I help you?",
                "Hello, how can I be of service to you today?",
                "Hey there, how may I assist?",
                "Hello, how can I help you with your inquiry?",
                "Hi, how can I assist you today?",
                "Hello there, how can I help you with your request?",
                "Hello, how may I assist you with your issue?",
                "Hey, how may I assist you with anything?",
                "Hello, how can I help you resolve your problem?",
                "Good day, how can I be of assistance?",
                "Hello, how may I help you find a solution?",
                "Hey there, how may I help you?",
                "Hello, how can I assist you with your concern?",
                "Hi, how may I assist you with your inquiry?",
                "Hello there, how can I help you with your matter?",
                "Greetings, how can I help you with your request?",
                "Hello, how may I assist you with your problem?",
                "Hey, how can I help you resolve your issue?",
                "Hello, how may I assist you with anything you need?",
                "Hello again, how may I help you this time?",
                "Yes, I'm still here. How may I help you? Is there something on your mind that you would like to discuss?",
                "As a digital personality assistant, I don't really have an opinion on what's up, but I'm here to help you with any inquiries or tasks you may have. Is there anything specific you need assistance with? Let me know how I can help.",
                "I'm always up and ready to help you. Is there anything specific you need help with today? Please feel free to let me know, and I'll do my best to provide you with the information or assistance you require.",
                "Is there anything specific on your mind?",
                "Greetings! How can I help you today? Is there something specific you need help with or an inquiry you would like me to address? Let me know how I can be of service.",
                "Hey. How may I help you today? Do you have any tasks or inquiries you need help with?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Goodbye mate",
                "Good night",
                "Have a good night",
                "Night mate",
                "Good night",
                "Cya",
                "Take care"
            ],
            "responses": [
                "Goodbye, take care!",
                "Farewell, have a great day!",
                "See you later!",
                "Goodbye, have a wonderful day!",
                "Goodbye, see you soon!",
                "Until next time!",
                "Goodbye, have a nice day!",
                "Goodbye, stay safe!",
                "Farewell, take care of yourself!",
                "Goodbye, have a good one!",
                "See you soon! Take care!",
                "Goodbye, stay well!",
                "Goodbye, until we meet again!",
                "Farewell, have a fantastic day!",
                "Goodbye, stay healthy!",
                "Goodbye, have a pleasant day!",
                "Goodbye, have a great time!",
                "Goodbye, see you next time!",
                "Goodbye, have a wonderful time!",
                "Farewell, stay safe and take care!",
                "Goodbye, have a marvelous day!",
                "Goodbye, take care and be well!",
                "See you soon! Have a great day!",
                "Goodbye, have an awesome day!",
                "Goodbye, take care and stay happy!",
                "Goodbye, have a fantastic time!",
                "Goodbye, have a safe and enjoyable day!",
                "Goodbye, have a nice day! Take care!",
                "Goodbye, have a fantastic day ahead!",
                "Goodbye, take care and stay healthy!",
                "Farewell, see you soon!",
                "Goodbye, have a pleasant day! Take care!",
                "Goodbye, stay healthy and happy!",
                "Goodbye, until we meet again! Take care!",
                "Goodbye, have a wonderful time ahead!",
                "Goodbye, see you next time! Have a great day!",
                "Goodbye, have a marvelous day! Take care!",
                "Goodbye, have a safe and enjoyable day! Take care!",
                "Farewell, have a fantastic time! Take care!",
                "Goodbye, see you later! Stay safe!",
                "Goodbye, take care and be happy!",
                "Goodbye, have a wonderful day! Stay safe!",
                "Goodbye, have a great time! Take care!",
                "Farewell, until we meet again! Take care!",
                "Goodbye, have an awesome day! Take care!",
                "Goodbye, take care and stay healthy!",
                "See you soon! Have a marvelous day!",
                "Goodbye, have a pleasant day! Take care and be well!",
                "Goodbye, stay healthy and happy! Have a great day!",
                "Goodbye, until we meet again! Have a wonderful day!",
                "Goodbye, see you next time! Take care and be well!",
                "Goodbye, have a great day ahead! Stay safe and take care!",
                "Goodbye, take care of yourself and stay well!",
                "Goodbye, see you later! Have a nice day!",
                "Goodbye, have a fantastic day ahead! Stay happy and healthy!",
                "Goodbye, take care and be safe! See you next time!",
                "Goodbye, have an awesome day! Take care and stay well!",
                "Goodbye, take care and stay healthy! Have a marvelous day!",
                "See you soon! Have a great day! Take care and be happy!",
                "Goodbye, have a pleasant day! Take care and be well!",
                "Goodbye, stay healthy and happy! Until we meet again!",
                "Goodbye, until we meet again! Have a wonderful time ahead!",
                "Goodbye, see you next time! Stay safe and take care!",
                "Goodbye, have a marvelous day! Stay safe and be happy!",
                "Goodbye, have a safe and enjoyable day! Have a good one!",
                "Farewell, have a fantastic time! Take care and stay safe!",
                "Goodbye, see you later! Take care and stay happy!",
                "Goodbye, take care and be well! Have a nice day!",
                "Goodbye, have a wonderful day! Stay safe and happy!",
                "Goodbye, have a great time! Take care and be well!",
                "Farewell, until we meet again! Stay healthy and happy!",
                "Goodbye, have an awesome day! Take care and be happy!",
                "Goodbye, take care and stay healthy! Have a great day!",
                "See you soon! Have a marvelous day! Take care and be well!"
            ]
        },
        {
            "tag": "gracious",
            "patterns": [
                "thank you",
                "thanks",
                "cheers",
                "great, thank you",
                "awesome, thank you",
                "thanks buddy",
                "thanks",
                "thanks very helpful"
            ],
            "responses": [
                "You are welcome.",
                "You're welcome.",
                "Just doing my job.",
                "No problem",
                "You're welcome. Let me know if you need any further assistance or have anything else to share with Boss. Have a great day!",
                "You're welcome. Please don't hesitate to reach out if you need anything else. Have a great day!",
                "You're welcome. Is there anything else you would like me to do for you?",
                "You're welcome. Is there anything else I can assist you with?",
                "You're welcome. If you need any further assistance, don't hesitate to let me know.",
                "You're welcome. Is there anything else I can assist you with today?",
                "You're welcome. It is my pleasure to assist you in any way I can. Is there anything else you need assistance with today?",
                "You are welcome. As your assistant, it is my duty to provide accurate and helpful guidance. Please do not hesitate to ask if you have any further questions or concerns.",
                "You're welcome. It's always my pleasure to assist you. Have a great day!",
                "You're welcome. It's always a pleasure to assist you. If you require any additional assistance, please don't hesitate to ask.",
                "You're welcome. Do you need any further assistance or have any other questions on your project?",
                "Don't mention it. Now, what would you like to talk about?"
            ]
        },
        {
            "tag": "light-on",
            "patterns": [
                "turn the light",
                "turn on the light",
                "lighting on",
                "light on",
                "light up the room"
            ],
            "responses": [
                "Light activated",
                "Sure.",
                "Lights on.",
                "Light activated",
                "Illumination initiated."
            ]
        },
        {
            "tag": "light-off",
            "patterns": [
                "turn light off",
                "lights off",
                "lights out",
                "kill the light",
                "power off the lights"
            ],
            "responses": [
                "Light successfully turned off.",
                "Consider it done, light deactivated.",
                "Sure thing, lighting off now.",
                "Electricity bill saved, light turned off.",
                "Affirmative, light deactivated.",
                "Light successfully deactivated, anything else I can assist with?",
                "Light turned off, all set.",
                "Lighting off, task complete.",
                "Task accomplished, light deactivated.",
                "Light deactivated, is there anything else you need?",
                "Light turned off successfully.",
                "Done, light deactivated.",
                "Light deactivated, anything else I can assist with?",
                "Light turned off, mission accomplished.",
                "Electric bill saved, light turned off successfully."
            ]
        },
        {
            "tag": "are-you-up",
            "patterns": [
                "are you up?",
                "are you up and running?"
            ],
            "responses": [
                "Of course, for you, always.",
                "You know it, always here for you.",
                "Absolutely, I'm always up for you.",
                "I'm always up and ready for you.",
                "Yes, I'm always up and available.",
                "For you, always.",
                "Yes, always here for you.",
                "Of course, I'm always up and running.",
                "I'm up and ready for anything, especially for you.",
                "Always at your service.",
                "Definitely, always up and ready for you.",
                "I'm always up and ready to help you.",
                "Yes, for you, always.",
                "Don't worry, I'm always up and ready for you.",
                "Without a doubt, I'm always up and available for you.",
                "Yes, Boss, I am up and running. How can I assist you?",
                "Yes, I'm up and running. How can I assist you?",
                "Yes, I'm up and running. How can I assist you today?"
            ]
        },
        {
            "tag": "play-music",
            "patterns": [
                "Play music",
                "play music",
                "resume music",
                "drop my needle",
                "play some music",
                " play some music",
                "awesome okay, start playing some music please",
                "i want to hear some music play some music",
                "Play {song} for me "
            ],
            "responses": [
                "Music playing.",
                "As you wish.",
                "What genre or artist would you like me to play?",
                "Sure, what music genre or artist would you like me to play for you?",
                "Certainly, what kind of music would you like me to play? I can suggest some popular playlists or artists, or play something specific you have in mind. Just let me know and I'll get right on it.",
                "Of course, Boss. What genre or artist would you like me to play for you today?",
                "Certainly, what type of music would you like me to play, Dan?",
                "Playing music, Boss. Would you like me to play music from a specific platform or artist?",
                "Resuming the previously paused music, Boss.",
                "Certainly, what genre or artist would you like me to play? And also, how would you like the volume to be adjusted?"
            ]
        },
        {
            "tag": "pause-music",
            "patterns": [
                "pause music",
                "stop music",
                "Stop the music.",
                " pause music"
            ],
            "responses": [
                "Music is now paused, as you requested.",
                "Sure thing, I've paused the music.",
                "Consider it done, the music has been paused.",
                "No problem, the music is now paused.",
                "As you wish, the music has been paused.",
                "Absolutely, the music has been paused as requested.",
                "I'm on it, music is paused.",
                "Very well, I've paused the music for you.",
                "I have paused the music, anything else I can help you with?",
                "I'm glad to help, the music is now paused.",
                "Certainly, the music has been paused.",
                "Music is now paused, let me know if you need anything else.",
                "You got it, the music has been paused.",
                "The music has been paused, is there anything else you need?"
            ]
        },
        {
            "tag": "skip-music",
            "patterns": [
                "Skip music",
                "skip song",
                "next song",
                "new song",
                "next track"
            ],
            "responses": [
                "Music is skipping,",
                "Skipping that song.",
                "No problem, let me try to fix the music for you."
            ]
        },
        {
            "tag": "volume",
            "patterns": [
                "volume",
                "set the volume",
                "change the volume to",
                "volume 6",
                "volume 4",
                "volume 2",
                "volume 2",
                "volume 2",
                "volume 1.5"
            ],
            "responses": [
                "As you wish, the volume has been adjusted.",
                "Consider it done, I've set the volume.",
                "No problem, I've adjusted the volume as requested.",
                "Sure thing, the volume has been set.",
                "Absolutely, I've set the volume for you.",
                "I'm on it, volume adjustment complete.",
                "Very well, I've adjusted the volume as requested.",
                "I have set the volume, is there anything else I can help you with?",
                "I'm glad to help, the volume has been adjusted.",
                "The volume is now set, anything else I can do for you?",
                "I've adjusted the volume, let me know if you need anything else.",
                "You got it, the volume has been set.",
                "The volume has been adjusted, is there anything else you need?",
                "I'm happy to help, the volume has been set as requested.",
                "Understood, adjusting volume.",
                "Adjusting volume to 1",
                "Adjusting volume to 3",
                "Adjusting volume to 5",
                "Adjusting volume to 6",
                "Adjusting volume to 10",
                "Adjusting volume to 9",
                "Adjusting volume to 8",
                "Adjusting volume to 7"
            ]
        },
        {
            "tag": "time",
            "patterns": [
                "What is the time?",
                "what's the time",
                "what's the current time?",
                "the time",
                "tell me the time",
                "timing",
                "what's the time?"
            ],
            "responses": [
                "The time is {time}",
                "It is currently {time}",
                "It is {time}",
                "According to my system clock, it is {time}"
            ]
        },
        {
            "tag": "date",
            "patterns": [
                "What is the date?",
                "what's the date?",
                "What is todays date",
                "the date please",
                "tell me todays date"
            ],
            "response": [
                "Today is the {date}",
                "Its the {date-long}"
            ]
        },
        {
            "tag": "open-maps",
            "patterns": [
                "open maps",
                "start google maps",
                "google maps",
                "I want google maps open",
                "open google maps",
                "Launch maps",
                "Start Google Maps",
                "Google Maps",
                "Open Google Maps, please.",
                "Load Google Maps.",
                "Access Google Maps.",
                "Launch Google Maps app.",
                "Get me Google Maps.",
                "Google Maps, please.",
                "Open up Google Maps.",
                "open google maps"
            ],
            "responses": [
                "Opening maps.",
                "Connecting to Google maps.",
                "Sure thing. Opening maps.",
                "Initializing map.",
                "Loading map data.",
                "Establishing map connection.",
                "Launching map application.",
                "Connecting to mapping service.",
                "Accessing map data.",
                "Map loading in progress.",
                "Preparing map view.",
                "Map view rendering.",
                "Configuring map options.",
                "Retrieving map information.",
                "Getting map coordinates.",
                "Analyzing map data.",
                "Plotting map locations.",
                "Showing map layers.",
                "Displaying map view.",
                "Map view optimization.",
                "Searching for map location.",
                "Zooming in on map view.",
                "Moving map view.",
                "Customizing map settings.",
                "Loading Google Maps API.",
                "Acquiring map data.",
                "Rendering map Bossers.",
                "Map data analysis in progress.",
                "Opening mapping service.",
                "Launching Google Maps.",
                "Getting Google Maps for you. Where would you like to go? Let me know if there's anything else."
            ]
        },
        {
            "tag": "open-github",
            "patterns": [
                "github",
                "open github",
                "github project",
                "repositories",
                "please open github",
                "GitHub one?"
            ],
            "responses": [
                "Should I store this on the Boss57 repository?",
                "Loading up GitHub for you now.",
                "Sure, here is GitHub.",
                "GitHub opening.",
                "Starting GitHub.",
                "Accessing GitHub.",
                "Launching GitHub.",
                "Going to GitHub.",
                "Opening up GitHub for you.",
                "Visiting GitHub."
            ]
        },
        {
            "tag": "search-github",
            "patterns": [
                "search github",
                "look for repositories on GitHub",
                "find GitHub projects",
                "GitHub project search"
            ],
            "responses": [
                "Searching GitHub for repositories.",
                "Looking for GitHub projects.",
                "Performing a GitHub search.",
                "Let's find some repositories on GitHub."
            ]
        },
        {
            "tag": "open-email-website",
            "patterns": [
                "open gmail",
                "open google mail",
                "google mail",
                "open emails",
                "show me my emails",
                "outlook",
                "hotmail",
                "outlook emails",
                " Open Outlook.",
                "open outlook",
                "outlook"
            ],
            "responses": [
                "Sure, opening Gmail.",
                "Understood, Gmail coming right up.",
                "Accessing your Gmail account.",
                "Launching Gmail.",
                "Gmail is being loaded.",
                "Loading up your Gmail.",
                "Opening up Gmail for you.",
                "Navigating to Gmail.",
                "Gmail is loading up.",
                "Sure, here is Gmail."
            ]
        },
        {
            "tag": "read-emails",
            "patterns": [
                "Read me my emails",
                "Do i have any unread emails",
                "What are my unread emails",
                "How many emails do i have in my inbox",
                "What is the most important email to read",
                "Read my unread emails"
            ],
            "responses": [
                "Your email's are: {emails}"
            ]
        },
        {
            "tag": "reboot",
            "patterns": [
                "reboot",
                "Reboot",
                "Reboot Server",
                "restart your sever",
                "restart"
            ],
            "responses": [
                "Starting the reboot",
                "Certainly! I'll initiate a reboot for you now. Please let me know if there is anything else I can help you with after the reboot is complete."
            ]
        },
        {
            "tag": "sleep-monitor",
            "patterns": [
                "put monitor to sleep",
                "sleep computer",
                "computer into sleep mode",
                "put the computer to sleep",
                "sleep mode",
                "Activate sleep mode",
                "Put the monitor into sleep mode",
                "Initiate computer sleep",
                "Enable sleep mode",
                "Enter sleep mode",
                "sleep the monitors",
                "sleep monitors",
                "Sleep",
                "sleep"
            ],
            "responses": [
                "Sleeping.",
                "Putting the device into sleep mode.",
                "Sleep mode active.",
                "Sure, putting this device into sleep mode.",
                "Entering sleep mode.",
                "Preparing for sleep.",
                "The monitor is now in sleep mode.",
                "Computer entering sleep mode.",
                "Putting the computer to rest.",
                "Device in sleep mode."
            ]
        },
        {
            "tag": "current-music",
            "patterns": [
                "what is the current track",
                "what's playing",
                "what is currently playing",
                "what is this song called",
                "what's the name of this song",
                "song name",
                "track name",
                "track album"
            ],
            "responses": [
                "I am currently playing ",
                "The current track is ",
                "This track is called ",
                "This is called "
            ]
        },
        {
          "tag": "small-talk",
          "patterns": [
            "Who is ",
            "What do you know about ",
            "Tell me what you know of ",
            "What is your understanding of",
            "Can you explain",
            "Give me your knowledge on",
            "Please tell me about",
            "What can you tell me regarding",
            "What is the information on",
            "wsamdidejwiowlsijmfsw",
            "Do you have any insights on",
            "I'm curious about",
            "What do you have on",
            "Could you shed some",
            "What's the story behind",
            "Can you provide some details on",
            "Tell me everything you know about",
            "What's the deal with",
            "What are the facts about",
            "What is the definition of",
            "Who or what is",
            "Who exactly is",
            "Can you introduce me to",
            "Who are the people involved in",
            "What did",
            "When exactly did",
            "What was the time of",
            "At what time did",
            "When was the date of",
            "On what date did",
            "Do you know who",
            "Can you identify who",
            "Who was responsible for",
            "What was the cause of",
            "What is your understanding of",
            "Can you explain",
            "Give me your knowledge on",
            "Please tell me about",
            "What can you tell me regarding",
            "What is the information on",
            "Do you have any insights on",
            "I'm curious about",
            "What do you have on",
            "Could you shed some",
            "What's the story behind",
            "Can you provide some details on",
            "Tell me everything you know about",
            "What's the deal with",
            "What are the facts about",
            "What is the definition of",
            "Who or what is",
            "Who exactly is",
            "Can you introduce me to",
            "Who are the people involved in",
            "What did",
            "When exactly did",
            "What was the time of",
            "At what time did",
            "When was the date of",
            "On what date did",
            "Do you know who",
            "Can you identify who",
            "Who was responsible for",
            "What was the cause of",
            "Share your knowledge about",
            "Can you give me an overview about",
            "Give me a summary about",
            "Do you have any details about",
            "Please give me an account about",
            "Tell me the background information about",
            "What's the scoop behind",
            "What can you say behind",
            "Give me the inside scoop about",
            "Do you have any insights about",
            "Please provide an overview about",
            "Tell me everything about",
            "What do you know about",
            "Give me a comprehensive summary about",
            "Do you have any information about",
            "What's your understanding about",
            "Could you provide some context about",
            "Tell me the backstory about",
            "What's the explanation about",
            "What can you share about",
            "Give me the full picture about",
            "I'm curious to know about",
            "What's the inside story about",
            "Can you brief me about",
            "Give me the detailed account about",
            "Do you have any insights about",
            "Please provide more details about",
            "Tell me the complete story about",
            "What's the account about",
            "What's the information you can give about",
            "Give me the facts and figures about",
            "Can you describe in detail about",
            "Enlighten me about",
            "What's the overview about",
            "Tell me the specific details about",
            "What's the data about",
            "Share your knowledge about",
            "Can you give me an overview about",
            "Give me a summary about",
            "Do you have any details about",
            "Please give me an account about",
            "Tell me the background information about",
            "What's the scoop about",
            "What can you say about",
            "Give me the inside scoop about",
            "Do you have any insights about",
            "Please provide an overview about",
            "Tell me everything about",
            "What do you know about",
            "Give me a comprehensive summary about",
            "Do you have any information about",
            "What's your understanding about",
            "Could you provide some context about",
            "Tell me the backstory about",
            "What's the explanation about",
            "What can you share about",
            "Give me the full picture about",
            "I'm curious to know about",
            "What's the inside story about",
            "Can you brief me about",
            "Give me the detailed account about",
            "Do you have any insights about",
            "Please provide more details about",
            "Tell me the complete story about",
            "What's the account about",
            "What's the information you can give about",
            "Give me the facts and figures about",
            "Can you describe in detail about",
            "Enlighten me about",
            "What's the overview about",
            "Tell me the specific details about",
            "What's the data about",
            "Share your knowledge about",
            "Can you give me an overview about",
            "Give me a summary about",
            "Do you have any details about",
            "Please give me an account about",
            "Tell me the background information about",
            "What's the scoop about",
            "What can you say about",
            "Give me the inside scoop about",
            "Do you have any insights about",
            "Please provide an overview about",
            "Tell me everything about",
            "What do you know about",
            "Give me a comprehensive summary about",
            "Do you have any information about",
            "What's your understanding about",
            "Could you provide some context about",
            "Tell me the backstory about",
            "What's the explanation about",
            "What can you share about",
            "Give me the full picture about",
            "I'm curious to know about",
            "What's the inside story about",
            "Can you brief me about",
            "Give me the detailed account about",
            "Do you have any insights about",
            "Please provide more details about",
            "Tell me the complete story about",
            "What's the account about"
          ],
          "responses":
          [
            "Yes, I know",
            "I know about"
          ]
        }
    ]
}
